Revit 2024 API
ParameterTypeId.RebarShapeHookEndType Property
 "Hook At End"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RebarShapeHookEndType { get; }
Visual Basic
Public Shared ReadOnly Property RebarShapeHookEndType As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RebarShapeHookEndType {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace